/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "Virheellinen parametri.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "Virheellinen tapahtumakoodi.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "Palvelimeen ei voitu muodostaa yhteyttä. Tarkista kirjautumistiedot.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "Käyttäjä on jo kirjautunut.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "Tapahtuman suoritus on jo käynnissä.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "Virheellinen tapahtumakonteksti.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "Virheellinen yhteyskäytännön tunnus.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "Virheellinen toimintoelementin tunnus.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "Yhteyskäytäntöä ei voitu määrittää.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "Tarkista salasanasi.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "Tämä laite on jo rekisteröity toiselle käyttäjälle.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "Syöttämäsi pääsykoodit eivät täsmää.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "Tapahtuma ei ole sallittu tässä tilassa.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "Syöttämäsi kirjautumistiedot ovat puutteellisia tai virheellisiä. Yritä uudelleen.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "Sovellusta ei voitu palauttaa. Tarkista, onko sinulla yhteys verkkoon.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "Palvelimeen ei voitu muodostaa yhteyttä. Tarkista kirjautumistiedot.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "Tarkista käyttäjänimesi ja salasanasi.";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "Palvelimeen ei voitu muodostaa yhteyttä. Ota yhteys pääkäyttäjään.";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "Syöttämäsi kirjautumistiedot ovat puutteellisia tai virheellisiä. Yritä uudelleen.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "Syötä oikea pääsykoodi.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "Syötä pääsykoodi, joka sisältää vähintään yhden numeron.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "Syöttämäsi pääsykoodit eivät täsmää.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "Pääsykoodi on vanhentunut. Se täytyy muuttaa.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "Syötä pääsykoodi, joka sisältää vähintään {0} merkkiä.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "Syötä pääsykoodi, joka sisältää vähintään yhden pienen kirjaimen.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "Syötä pääsykoodi, joka sisältää vähintään yhden erikoismerkin.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "Syötä pääsykoodi, joka sisältää vähintään {0} ainutkertaista merkkiä.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "Syötä pääsykoodi, joka sisältää vähintään yhden ison kirjaimen.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "Varmenteen avainta ei voitu noutaa.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "Varmennetta ei voitu noutaa.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "Tuntematon virhe";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "Suojattu muisti on jo olemassa";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "Tietotyyppivirhe";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "Suojattua muistia ei ole";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "Virheellinen argumentti";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "Syötä oikea pääsykoodi.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "Suojattu muisti on lukittu";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "Suojatun muistin kapasiteetti on käytetty";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "Pääsykoodi on vanhentunut. Se täytyy muuttaa.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "Syötä pääsykoodi, joka sisältää vähintään {0} ainutkertaista merkkiä.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "Syötä pääsykoodi, joka sisältää vähintään yhden numeron.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "Syötä pääsykoodi, joka sisältää vähintään yhden pienen kirjaimen.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "Syötä pääsykoodi, joka sisältää vähintään yhden erikoismerkin.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "Syötä pääsykoodi, joka sisältää vähintään yhden ison kirjaimen.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "Syötä pääsykoodi, joka sisältää vähintään {0} merkkiä.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "Syötä pääsykoodi, joka sisältää vähintään {0} ainutkertaista merkkiä.";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "Suojattu muisti on poistettu.";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "Tapahtumaa ei tueta.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "Virheellinen SSO-pääsykoodi.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Virheelliset Afaria-kirjautumistiedot.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "Client Identity not found";

/* XMSG: message */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "Access is denied";

